usr_wg_HourType(150921260,147060475,"Я","0","Часы (дни) работы",1,"Явка",1,0,0,0).
usr_wg_HourType(150921260,147060476,"Н","02","Ночные часы работы",1,"",0,0,0,0).
usr_wg_HourType(150921260,147060477,"С","05","Сверхурочные часы работы",1,"",0,0,0,0).
usr_wg_HourType(150921260,147060478,"РП","0","Часы работы в государственные праздники, праздничные (нерабочие) и выходные дни",1,"",0,0,0,0).
usr_wg_HourType(150921260,147060479,"К","0","Служебные командировки",1,"",0,0,0,0).
usr_wg_HourType(150921260,147060480,"СХ","0","Временное отвлечение на сельскохозяйственные работы",0,"",0,0,0,0).
usr_wg_HourType(150921260,147060481,"О","0","Трудовой отпуск",0,"",0,0,0,0).
usr_wg_HourType(150921260,147060482,"ДПО","0","Дополнительный поощрительный отпуск",0,"",0,0,0,0).
usr_wg_HourType(150921260,147060483,"У","0","Отпуска в связи с обучением с сохранением заработной платы, повышением квалификации с отрывом от производства и другие",0,"",0,0,0,0).
usr_wg_HourType(150921260,147060484,"УД","0","Сокращенная продолжительность рабочего времени для обучающихся без отрыва от производства",1,"",0,0,0,0).
usr_wg_HourType(150921260,147060485,"УБЗ","0","Отпуска в связи с обучением без сохранения заработной платы",0,"УБЗ",1,0,0,0).
usr_wg_HourType(150921260,147060486,"Р","0","Отпуска по беременности и родам",0,"",1,0,0,0).
usr_wg_HourType(150921260,147060487,"ОЖ","0","Дополнительный отпуск, предоставляемый по уходу за ребенком до достижения им возраста трех лет",0,"",0,0,0,0).
usr_wg_HourType(150921260,147060488,"Г","0","Дни неявок работников, освобожденных временно от работы в связи с выполнением государственных или общественных обязанностей, в случаях, предусмотренных законодательством",0,"",0,0,0,0).
usr_wg_HourType(150921260,147060489,"ГП","0","Допризывная подготовка",0,"",0,0,0,0).
usr_wg_HourType(150921260,147060490,"ГЧ","0","Военно-учебные сборы",0,"",0,0,0,0).
usr_wg_HourType(150921260,147060491,"МО","0","Неявки на работу в связи с нахождением в медицинских учреждениях на обследовании или осмотре работника, обязанного проходить такие обследования",0,"",0,0,0,0).
usr_wg_HourType(150921260,147060492,"Д","0","Дни неявок на работу работников, являющихся донорами, для обследования и сдачи крови и ее компонентов, дополнительный день отдыха, предоставляемый после этого или используемый в другое время",0,"",0,0,0,0).
usr_wg_HourType(150921260,147060493,"ЛО","0","Социальный отпуск с сохранением заработной платы для лечения и иных личных потребностей работника",0,"",0,0,0,0).
usr_wg_HourType(150921260,147060494,"ДО","0","Кратковременные отпуска без сохранения заработной платы, которые наниматель обязан предоставить работнику",0,"",0,0,0,0).
usr_wg_HourType(150921260,147060495,"ТВО","0","Творческий отпуск с сохранением заработной платы",0,"",0,0,0,0).
usr_wg_HourType(150921260,147060496,"ГБ","0","Дни неявок работников, отвлеченных на устранение последствий стихийных бедствий",0,"",0,0,0,0).
usr_wg_HourType(150921260,147060497,"ДМ","0","Свободный от работы день матерям, воспитывающим ребенка-инвалида в возрасте до восемнадцати лет или воспитывающим двоих и более детей в возрасте до шестнадцати лет, одиноким матерям, воспитывающим двоих и более детей в возрасте до шестнадцати лет",0,"",0,0,0,0).
usr_wg_HourType(150921260,147060498,"ГС","0","Дни неявок на работу работников, находящихся под следствием до решения суда",0,"",0,0,0,0).
usr_wg_HourType(150921260,147060499,"ОТ","0","Дополнительные свободные от работы дни, предусмотренные коллективным договором сверх установленных законодательством Республики Беларусь",0,"",0,0,0,0).
usr_wg_HourType(150921260,147060500,"Б","0","Временная нетрудоспособность (кроме случаев, предусмотренных кодами Т и Х) и отпуска по уходу за больными и по карантину, оформленные листками нетрудоспособности",0,"",0,0,0,0).
usr_wg_HourType(150921260,147060501,"Т","0","Неоплачиваемая нетрудоспособность в случаях, предусмотренных законодательством Республики Беларусь",0,"",0,0,0,1).
usr_wg_HourType(150921260,147060502,"Х","0","Неявки на работу в связи с карантином или уходом за больными, оформленные справками лечебных учреждений",0,"",0,0,0,0).
usr_wg_HourType(150921260,147060503,"А","0","Отпуска без сохранения заработной платы по семейно-бытовым и другим уважительным причинам, предоставляемые по договоренности между работником и нанимателем",0,"Отпуск без сохранения(А)",1,0,0,0).
usr_wg_HourType(150921260,147060504,"ОА","0","Отпуска, предоставляемые по инициативе нанимателя",0,"",0,0,0,0).
usr_wg_HourType(150921260,147060505,"ОАД","0","Неотработанные рабочие дни при временном переводе работников по инициативе нанимателя на работу с неполной рабочей неделей",0,"",0,0,0,0).
usr_wg_HourType(150921260,147060506,"П","0","Целодневные (целосменные) простои",1,"",0,0,0,0).
usr_wg_HourType(150921260,147060507,"ВП","0","Внутрисменные простои",1,"",0,0,0,0).
usr_wg_HourType(150921260,147060508,"ПР","0","Прогулы и другие неявки без уважительной причины",0,"",0,0,0,1).
usr_wg_HourType(150921260,147060509,"З","0","Неявки из-за забастовок",0,"",0,0,0,0).
usr_wg_HourType(150921260,147060510,"ОП","0","Опоздания",1,"",0,0,0,0).
usr_wg_HourType(150921260,147060511,"УХ","0","Преждевременный уход с работы",1,"",0,0,0,0).
usr_wg_HourType(150921260,147060512,"НН","0","Неявки по невыясненным причинам (до выяснения обстоятельств)",0,"",0,0,0,0).
usr_wg_HourType(150921260,147060513,"В","0","Государственные праздники, праздничные (нерабочие) дни и выходные дни (дни еженедельного отдыха)",0,"",0,0,0,0).
usr_wg_HourType(150921260,147071958,"РЕМ","0","Ремонт. Плановый ремонт.Простои связанные с ремонтом.",1,"",0,0,0,0).
usr_wg_HourType(150921260,147071962,"НПР","0","Ночные праздничные дни",1,"",0,0,0,0).
usr_wg_HourType(150921260,147401900,"Р","0","Декретный больничный",0,"",0,0,0,0).
usr_wg_HourType(150921260,149129235,"Крп","0","Командировка в праздники",0,"",0,0,0,0).
usr_wg_HourType(150921260,149230836,"ВК","0","Выходной за командировку",1,"",1,0,0,0).
usr_wg_HourType(150921260,150984094,"ДЦ","0","Другой цех (ДЦ)",0,"",0,0,0,0).
usr_wg_HourType(150921260,150984141,"1","0","номер смены 1",1,"",1,0,0,0).
usr_wg_HourType(150921260,150984142,"2","0","номер смены 2",1,"",1,0,0,0).
usr_wg_HourType(150921260,150984143,"3","0","номер смены 3",1,"",0,0,0,0).
usr_wg_HourType(150921260,150984144,"Другое","0","Иной тип часов",0,"",0,0,0,0).
usr_wg_HourType(150921260,150987902,"Я","0","Часы (дни) работы",1,"Явка(Я)",1,0,0,0).
usr_wg_HourType(148441437,147060475,"Я","0","Часы (дни) работы",1,"Явка",1,0,0,0).
usr_wg_HourType(148441437,147060476,"Н","02","Ночные часы работы",1,"",0,0,0,0).
usr_wg_HourType(148441437,147060477,"С","05","Сверхурочные часы работы",1,"",0,0,0,0).
usr_wg_HourType(148441437,147060478,"РП","0","Часы работы в государственные праздники, праздничные (нерабочие) и выходные дни",1,"",0,0,0,0).
usr_wg_HourType(148441437,147060479,"К","0","Служебные командировки",1,"",0,0,0,0).
usr_wg_HourType(148441437,147060480,"СХ","0","Временное отвлечение на сельскохозяйственные работы",0,"",0,0,0,0).
usr_wg_HourType(148441437,147060481,"О","0","Трудовой отпуск",0,"",0,0,0,0).
usr_wg_HourType(148441437,147060482,"ДПО","0","Дополнительный поощрительный отпуск",0,"",0,0,0,0).
usr_wg_HourType(148441437,147060483,"У","0","Отпуска в связи с обучением с сохранением заработной платы, повышением квалификации с отрывом от производства и другие",0,"",0,0,0,0).
usr_wg_HourType(148441437,147060484,"УД","0","Сокращенная продолжительность рабочего времени для обучающихся без отрыва от производства",1,"",0,0,0,0).
usr_wg_HourType(148441437,147060485,"УБЗ","0","Отпуска в связи с обучением без сохранения заработной платы",0,"УБЗ",1,0,0,0).
usr_wg_HourType(148441437,147060486,"Р","0","Отпуска по беременности и родам",0,"",1,0,0,0).
usr_wg_HourType(148441437,147060487,"ОЖ","0","Дополнительный отпуск, предоставляемый по уходу за ребенком до достижения им возраста трех лет",0,"",0,0,0,0).
usr_wg_HourType(148441437,147060488,"Г","0","Дни неявок работников, освобожденных временно от работы в связи с выполнением государственных или общественных обязанностей, в случаях, предусмотренных законодательством",0,"",0,0,0,0).
usr_wg_HourType(148441437,147060489,"ГП","0","Допризывная подготовка",0,"",0,0,0,0).
usr_wg_HourType(148441437,147060490,"ГЧ","0","Военно-учебные сборы",0,"",0,0,0,0).
usr_wg_HourType(148441437,147060491,"МО","0","Неявки на работу в связи с нахождением в медицинских учреждениях на обследовании или осмотре работника, обязанного проходить такие обследования",0,"",0,0,0,0).
usr_wg_HourType(148441437,147060492,"Д","0","Дни неявок на работу работников, являющихся донорами, для обследования и сдачи крови и ее компонентов, дополнительный день отдыха, предоставляемый после этого или используемый в другое время",0,"",0,0,0,0).
usr_wg_HourType(148441437,147060493,"ЛО","0","Социальный отпуск с сохранением заработной платы для лечения и иных личных потребностей работника",0,"",0,0,0,0).
usr_wg_HourType(148441437,147060494,"ДО","0","Кратковременные отпуска без сохранения заработной платы, которые наниматель обязан предоставить работнику",0,"",0,0,0,0).
usr_wg_HourType(148441437,147060495,"ТВО","0","Творческий отпуск с сохранением заработной платы",0,"",0,0,0,0).
usr_wg_HourType(148441437,147060496,"ГБ","0","Дни неявок работников, отвлеченных на устранение последствий стихийных бедствий",0,"",0,0,0,0).
usr_wg_HourType(148441437,147060497,"ДМ","0","Свободный от работы день матерям, воспитывающим ребенка-инвалида в возрасте до восемнадцати лет или воспитывающим двоих и более детей в возрасте до шестнадцати лет, одиноким матерям, воспитывающим двоих и более детей в возрасте до шестнадцати лет",0,"",0,0,0,0).
usr_wg_HourType(148441437,147060498,"ГС","0","Дни неявок на работу работников, находящихся под следствием до решения суда",0,"",0,0,0,0).
usr_wg_HourType(148441437,147060499,"ОТ","0","Дополнительные свободные от работы дни, предусмотренные коллективным договором сверх установленных законодательством Республики Беларусь",0,"",0,0,0,0).
usr_wg_HourType(148441437,147060500,"Б","0","Временная нетрудоспособность (кроме случаев, предусмотренных кодами Т и Х) и отпуска по уходу за больными и по карантину, оформленные листками нетрудоспособности",0,"",0,0,0,0).
usr_wg_HourType(148441437,147060501,"Т","0","Неоплачиваемая нетрудоспособность в случаях, предусмотренных законодательством Республики Беларусь",0,"",0,0,0,1).
usr_wg_HourType(148441437,147060502,"Х","0","Неявки на работу в связи с карантином или уходом за больными, оформленные справками лечебных учреждений",0,"",0,0,0,0).
usr_wg_HourType(148441437,147060503,"А","0","Отпуска без сохранения заработной платы по семейно-бытовым и другим уважительным причинам, предоставляемые по договоренности между работником и нанимателем",0,"Отпуск без сохранения(А)",1,0,0,0).
usr_wg_HourType(148441437,147060504,"ОА","0","Отпуска, предоставляемые по инициативе нанимателя",0,"",0,0,0,0).
usr_wg_HourType(148441437,147060505,"ОАД","0","Неотработанные рабочие дни при временном переводе работников по инициативе нанимателя на работу с неполной рабочей неделей",0,"",0,0,0,0).
usr_wg_HourType(148441437,147060506,"П","0","Целодневные (целосменные) простои",1,"",0,0,0,0).
usr_wg_HourType(148441437,147060507,"ВП","0","Внутрисменные простои",1,"",0,0,0,0).
usr_wg_HourType(148441437,147060508,"ПР","0","Прогулы и другие неявки без уважительной причины",0,"",0,0,0,1).
usr_wg_HourType(148441437,147060509,"З","0","Неявки из-за забастовок",0,"",0,0,0,0).
usr_wg_HourType(148441437,147060510,"ОП","0","Опоздания",1,"",0,0,0,0).
usr_wg_HourType(148441437,147060511,"УХ","0","Преждевременный уход с работы",1,"",0,0,0,0).
usr_wg_HourType(148441437,147060512,"НН","0","Неявки по невыясненным причинам (до выяснения обстоятельств)",0,"",0,0,0,0).
usr_wg_HourType(148441437,147060513,"В","0","Государственные праздники, праздничные (нерабочие) дни и выходные дни (дни еженедельного отдыха)",0,"",0,0,0,0).
usr_wg_HourType(148441437,147071958,"РЕМ","0","Ремонт. Плановый ремонт.Простои связанные с ремонтом.",1,"",0,0,0,0).
usr_wg_HourType(148441437,147071962,"НПР","0","Ночные праздничные дни",1,"",0,0,0,0).
usr_wg_HourType(148441437,147401900,"Р","0","Декретный больничный",0,"",0,0,0,0).
usr_wg_HourType(148441437,149129235,"Крп","0","Командировка в праздники",0,"",0,0,0,0).
usr_wg_HourType(148441437,149230836,"ВК","0","Выходной за командировку",1,"",1,0,0,0).
usr_wg_HourType(148441437,150984094,"ДЦ","0","Другой цех (ДЦ)",0,"",0,0,0,0).
usr_wg_HourType(148441437,150984141,"1","0","номер смены 1",1,"",1,0,0,0).
usr_wg_HourType(148441437,150984142,"2","0","номер смены 2",1,"",1,0,0,0).
usr_wg_HourType(148441437,150984143,"3","0","номер смены 3",1,"",0,0,0,0).
usr_wg_HourType(148441437,150984144,"Другое","0","Иной тип часов",0,"",0,0,0,0).
usr_wg_HourType(148441437,150987902,"Я","0","Часы (дни) работы",1,"Явка(Я)",1,0,0,0).
