usr_wg_HourType(202116758,332469774,328608440,"О","0","Трудовой отпуск",0,"Трудовой отпуск (О)",0,0,0,1).
usr_wg_HourType(202116758,332469774,328608442,"Р","0","Отпуска по беременности и родам",0,"",0,0,0,1).
usr_wg_HourType(202116758,332469774,328608444,"ОЖ","0","Дополнительный отпуск, предоставляемый по уходу за ребенком до достижения им возраста трех лет",0,"",0,0,0,1).
usr_wg_HourType(202116758,332469774,328608446,"УБЗ","0","Отпуска в связи с обучением без сохранения заработной платы",0,"",0,0,0,1).
usr_wg_HourType(202116758,332469774,328608448,"ЛО","0","Социальный отпуск с сохранением заработной платы для лечения и иных личных потребностей работника",0,"",0,0,0,0).
usr_wg_HourType(202116758,332469774,328608450,"ТВО","0","Творческий отпуск с сохранением заработной платы",0,"",0,0,0,0).
usr_wg_HourType(202116758,332469774,328608452,"А","0","Отпуска без сохранения заработной платы по семейно-бытовым и другим уважительным причинам, предоставляемые по договоренности между работником и нанимателем",0,"Отпуска без сохранения ЗП (А)",1,0,0,1).
usr_wg_HourType(202116758,332469774,328609348,"СХ","0","Временное отвлечение на сельскохозяйственные работы",0,"",0,0,0,0).
usr_wg_HourType(202116758,332469774,328609350,"ДПО","0","Дополнительный поощрительный отпуск",0,"",0,0,0,1).
usr_wg_HourType(202116758,332469774,328609352,"У","0","Отпуска в связи с обучением с сохранением заработной платы, повышением квалификации с отрывом от производства и другие",0,"",0,0,0,1).
usr_wg_HourType(202116758,332469774,328609354,"Г","0","Дни неявок работников, освобожденных временно от работы в связи с выполнением государственных или общественных обязанностей, в случаях, предусмотренных законодательством",0,"Гособязаность (Г)",1,0,0,1).
usr_wg_HourType(202116758,332469774,328609356,"Д","0","Дни неявок на работу работников, являющихся донорами, для обследования и сдачи крови и ее компонентов, дополнительный день отдыха, предоставляемый после этого или используемый в другое время",0,"Донорство (Д)",1,0,0,1).
usr_wg_HourType(202116758,332469774,328609359,"ГБ","0","Дни неявок работников, отвлеченных на устранение последствий стихийных бедствий",0,"",0,0,0,1).
usr_wg_HourType(202116758,332469774,328609361,"ГП","0","Допризывная подготовка",0,"",0,0,0,1).
usr_wg_HourType(202116758,332469774,328609363,"ГЧ","0","Военно-учебные сборы",0,"",0,0,0,1).
usr_wg_HourType(202116758,332469774,328609365,"ДМ","0","Свободный от работы день матерям, воспитывающим ребенка-инвалида в возрасте до восемнадцати лет или воспитывающим двоих и более детей в возрасте до шестнадцати лет, одиноким матерям, воспитывающим двоих и более детей в возрасте до шестнадцати лет",0,"День матери (ДМ)",0,0,0,1).
usr_wg_HourType(202116758,332469774,328609367,"ОТ","0","Дополнительные свободные от работы дни, предусмотренные коллективным договором сверх установленных законодательством Республики Беларусь",0,"",0,0,0,0).
usr_wg_HourType(202116758,332469774,328609369,"МО","0","Неявки на работу в связи с нахождением в медицинских учреждениях на обследовании или осмотре работника, обязанного проходить такие обследования",0,"",0,0,0,1).
usr_wg_HourType(202116758,332469774,328624497,"Я","01","Часы (дни) работы",1,"",0,0,0,0).
usr_wg_HourType(202116758,332469774,328624498,"Н","02","Ночные часы работы",1,"",0,0,0,0).
usr_wg_HourType(202116758,332469774,328624499,"С","05","Сверхурочные часы работы",1,"",0,0,0,0).
usr_wg_HourType(202116758,332469774,328624500,"РП","0","Часы работы в государственные праздники, праздничные (нерабочие) и выходные дни",1,"",0,0,0,0).
usr_wg_HourType(202116758,332469774,328624501,"К","0","Служебные командировки",1,"Командировка (К)",0,0,0,0).
usr_wg_HourType(202116758,332469774,328624502,"УД","0","Сокращенная продолжительность рабочего времени для обучающихся без отрыва от производства",1,"",0,0,0,0).
usr_wg_HourType(202116758,332469774,328624503,"ДО","0","Кратковременные отпуска без сохранения заработной платы, которые наниматель обязан предоставить работнику",0,"",0,0,0,1).
usr_wg_HourType(202116758,332469774,328624504,"ГС","0","Дни неявок на работу работников, находящихся под следствием до решения суда",0,"",0,0,0,1).
usr_wg_HourType(202116758,332469774,328624505,"Б","0","Временная нетрудоспособность (кроме случаев, предусмотренных кодами Т и Х) и отпуска по уходу за больными и по карантину, оформленные листками нетрудоспособности",0,"Больничный (Б)",0,0,0,1).
usr_wg_HourType(202116758,332469774,328624506,"Т","0","Неоплачиваемая нетрудоспособность в случаях, предусмотренных законодательством Республики Беларусь",0,"",0,0,0,0).
usr_wg_HourType(202116758,332469774,328624507,"Х","0","Неявки на работу в связи с карантином или уходом за больными, оформленные справками лечебных учреждений",0,"",0,0,0,0).
usr_wg_HourType(202116758,332469774,328624508,"ОА","0","Отпуска, предоставляемые по инициативе нанимателя",0,"",0,0,0,1).
usr_wg_HourType(202116758,332469774,328624509,"ОАД","0","Неотработанные рабочие дни при временном переводе работников по инициативе нанимателя на работу с неполной рабочей неделей",0,"",0,0,0,1).
usr_wg_HourType(202116758,332469774,328624510,"П","0","Целодневные (целосменные) простои",1,"",0,0,0,0).
usr_wg_HourType(202116758,332469774,328624511,"ВП","0","Внутрисменные простои",1,"",0,0,0,0).
usr_wg_HourType(202116758,332469774,328624512,"ПР","0","Прогулы и другие неявки без уважительной причины",0,"Прогул (П)",0,0,0,0).
usr_wg_HourType(202116758,332469774,328624513,"З","0","Неявки из-за забастовок",0,"",0,0,0,0).
usr_wg_HourType(202116758,332469774,328624514,"ОП","0","Опоздания",1,"",0,0,0,0).
usr_wg_HourType(202116758,332469774,328624515,"УХ","0","Преждевременный уход с работы",1,"",0,0,0,0).
usr_wg_HourType(202116758,332469774,328624516,"НН","0","Неявки по невыясненным причинам (до выяснения обстоятельств)",0,"",0,0,0,0).
usr_wg_HourType(202116758,332469774,328624517,"В","0","Государственные праздники, праздничные (нерабочие) дни и выходные дни (дни еженедельного отдыха)",0,"Выходные",0,0,0,0).
usr_wg_HourType(202116758,332469774,328624780,"РЕМ","0","Ремонт. Плановый ремонт.Простои связанные с ремонтом.",1,"",0,0,0,0).
usr_wg_HourType(202116758,332469774,328624784,"НПР","0","Ночные праздничные дни",1,"",0,0,0,0).
usr_wg_HourType(202116758,332469774,522791170,"ДЦ","0","Другой цех (ДЦ)",0,"",0,0,0,0).
usr_wg_HourType(202116758,332469774,522933839,"1","0","номер смены 1",1,"",1,0,0,0).
usr_wg_HourType(202116758,332469774,522933841,"2","0","номер смены 2",1,"",1,0,0,0).
usr_wg_HourType(202116758,332469774,522933843,"3","0","номер смены 3",1,"",1,0,0,0).
usr_wg_HourType(202116758,332469774,522933845,"ДР","0","Иной тип часов",0,"Другое (ДР)",0,0,0,0).
usr_wg_HourType(202116758,332469774,526631588,"4","0","номер смены 4",1,"",1,0,0,0).
usr_wg_HourType(202116758,332469774,527549811,"6","0","номер смены 6",1,"",1,0,0,0).
usr_wg_HourType(202116758,332469774,526631601,"5","0","номер смены 5",1,"",1,0,0,0).
