usr_wg_HourType(154242641,154242645,154131786,"О","0","Трудовой отпуск",0,"",1,0,0,0).
usr_wg_HourType(154242641,154242645,154131788,"Р","0","Отпуска по беременности и родам",0,"",1,0,0,0).
usr_wg_HourType(154242641,154242645,154131790,"ОЖ","0","Дополнительный отпуск, предоставляемый по уходу за ребенком до достижения им возраста трех лет",0,"Уход за ребенком",1,0,0,0).
usr_wg_HourType(154242641,154242645,154131792,"УБЗ","0","Отпуска в связи с обучением без сохранения заработной платы",0,"Обучение",1,0,0,0).
usr_wg_HourType(154242641,154242645,154131794,"ЛО","0","Социальный отпуск с сохранением заработной платы для лечения и иных личных потребностей работника",0,"",0,0,0,0).
usr_wg_HourType(154242641,154242645,154131796,"ТВО","0","Творческий отпуск с сохранением заработной платы",0,"",0,0,0,0).
usr_wg_HourType(154242641,154242645,154131798,"А","0","Отпуска без сохранения заработной платы по семейно-бытовым и другим уважительным причинам, предоставляемые по договоренности между работником и нанимателем",0,"За свой счет",1,0,0,0).
usr_wg_HourType(154242641,154242645,154132694,"СХ","0","Временное отвлечение на сельскохозяйственные работы",0,"Сельскохозяйственные работы",1,0,0,0).
usr_wg_HourType(154242641,154242645,154132696,"ДПО","0","Дополнительный поощрительный отпуск",0,"",0,0,0,0).
usr_wg_HourType(154242641,154242645,154132698,"У","0","Отпуска в связи с обучением с сохранением заработной платы, повышением квалификации с отрывом от производства и другие",0,"В связи с обучением",1,0,0,0).
usr_wg_HourType(154242641,154242645,154132700,"Г","0","Дни неявок работников, освобожденных временно от работы в связи с выполнением государственных или общественных обязанностей, в случаях, предусмотренных законодательством",0,"Общественные или гособязанности",1,0,0,0).
usr_wg_HourType(154242641,154242645,154132702,"Д","0","Дни неявок на работу работников, являющихся донорами, для обследования и сдачи крови и ее компонентов, дополнительный день отдыха, предоставляемый после этого или используемый в другое время",0,"Донорство",1,0,0,0).
usr_wg_HourType(154242641,154242645,154132705,"ГБ","0","Дни неявок работников, отвлеченных на устранение последствий стихийных бедствий",0,"",0,0,0,0).
usr_wg_HourType(154242641,154242645,154132707,"ГП","0","Допризывная подготовка",0,"",0,0,0,0).
usr_wg_HourType(154242641,154242645,154132709,"ГЧ","0","Военно-учебные сборы",0,"",1,0,0,0).
usr_wg_HourType(154242641,154242645,154132711,"ДМ","0","Свободный от работы день матерям, воспитывающим ребенка-инвалида в возрасте до восемнадцати лет или воспитывающим двоих и более детей в возрасте до шестнадцати лет, одиноким матерям, воспитывающим двоих и более детей в возрасте до шестнадцати лет",0,"День матери",1,0,0,0).
usr_wg_HourType(154242641,154242645,154132713,"ОТ","0","Дополнительные свободные от работы дни, предусмотренные коллективным договором сверх установленных законодательством Республики Беларусь",0,"",0,0,0,0).
usr_wg_HourType(154242641,154242645,154132715,"МО","0","Неявки на работу в связи с нахождением в медицинских учреждениях на обследовании или осмотре работника, обязанного проходить такие обследования",0,"",0,0,0,0).
usr_wg_HourType(154242641,154242645,154139945,"Я","01","Часы (дни) работы",1,"",0,0,0,0).
usr_wg_HourType(154242641,154242645,154139946,"Н","02","Ночные часы работы",1,"",0,0,0,0).
usr_wg_HourType(154242641,154242645,154139947,"С","05","Сверхурочные часы работы",1,"",0,0,0,0).
usr_wg_HourType(154242641,154242645,154139948,"РП","0","Часы работы в государственные праздники, праздничные (нерабочие) и выходные дни",1,"",0,0,0,0).
usr_wg_HourType(154242641,154242645,154139949,"К","0","Служебные командировки",1,"",0,0,0,0).
usr_wg_HourType(154242641,154242645,154139950,"УД","0","Сокращенная продолжительность рабочего времени для обучающихся без отрыва от производства",1,"",0,0,0,0).
usr_wg_HourType(154242641,154242645,154139951,"ДО","0","Кратковременные отпуска без сохранения заработной платы, которые наниматель обязан предоставить работнику",0,"",0,0,0,0).
usr_wg_HourType(154242641,154242645,154139952,"ГС","0","Дни неявок на работу работников, находящихся под следствием до решения суда",0,"Под следствием",1,0,0,0).
usr_wg_HourType(154242641,154242645,154139953,"Б","0","Временная нетрудоспособность (кроме случаев, предусмотренных кодами Т и Х) и отпуска по уходу за больными и по карантину, оформленные листками нетрудоспособности",0,"Временная нетрудоспособность",1,0,0,0).
usr_wg_HourType(154242641,154242645,154139954,"Т","0","Неоплачиваемая нетрудоспособность в случаях, предусмотренных законодательством Республики Беларусь",0,"",0,0,0,0).
usr_wg_HourType(154242641,154242645,154139955,"Х","0","Неявки на работу в связи с карантином или уходом за больными, оформленные справками лечебных учреждений",0,"",0,0,0,0).
usr_wg_HourType(154242641,154242645,154139956,"ОА","0","Отпуска, предоставляемые по инициативе нанимателя",0,"Отпуск по инициативе нанимателя",1,0,0,0).
usr_wg_HourType(154242641,154242645,154139957,"ОАД","0","Неотработанные рабочие дни при временном переводе работников по инициативе нанимателя на работу с неполной рабочей неделей",0,"",0,0,0,0).
usr_wg_HourType(154242641,154242645,154139958,"П","0","Целодневные (целосменные) простои",1,"",0,0,0,0).
usr_wg_HourType(154242641,154242645,154139959,"ВП","0","Внутрисменные простои",1,"",0,0,0,0).
usr_wg_HourType(154242641,154242645,154139960,"ПР","0","Прогулы и другие неявки без уважительной причины",0,"Без уважительной причины",1,0,0,0).
usr_wg_HourType(154242641,154242645,154139961,"З","0","Неявки из-за забастовок",0,"",0,0,0,0).
usr_wg_HourType(154242641,154242645,154139962,"ОП","0","Опоздания",1,"",0,0,0,0).
usr_wg_HourType(154242641,154242645,154139963,"УХ","0","Преждевременный уход с работы",1,"",0,0,0,0).
usr_wg_HourType(154242641,154242645,154139964,"НН","0","Неявки по невыясненным причинам (до выяснения обстоятельств)",0,"",0,0,0,0).
usr_wg_HourType(154242641,154242645,154139965,"В","0","Государственные праздники, праздничные (нерабочие) дни и выходные дни (дни еженедельного отдыха)",0,"",0,0,0,0).
usr_wg_HourType(154242641,154242645,154140224,"РЕМ","0","Ремонт. Плановый ремонт.Простои связанные с ремонтом.",1,"Ремонт",1,0,0,0).
usr_wg_HourType(154242641,154242645,154140228,"НПР","0","Ночные праздничные дни",1,"",0,0,0,0).
usr_wg_HourType(154242641,154242645,154142680,"ДЦ","0","Другой цех (ДЦ)",0,"",1,0,0,0).
usr_wg_HourType(154242641,154242645,154142726,"1","0","номер смены 1",1,"",0,0,0,0).
usr_wg_HourType(154242641,154242645,154142727,"2","0","номер смены 2",1,"",0,0,0,0).
usr_wg_HourType(154242641,154242645,154142728,"3","0","номер смены 3",1,"",0,0,0,0).
usr_wg_HourType(154242641,154242645,154142729,"Другое","0","Иной тип часов",0,"",0,0,0,0).
usr_wg_HourType(154242641,154242645,156145785,"СП","111","Справка",0,"",1,0,0,0).
